# CreateCoreGeometryFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..CreateCoreGeometryFailed Property
BuiltInFailures..::..MassFailures Class See Also
---
Failed to create core geometries.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CreateCoreGeometryFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CreateCoreGeometryFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CreateCoreGeometryFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace